/****************************************************************************
* 文件名：i2c_com.c
* 功能：硬件I2C软件包。
* 说明：主程序要配置好I2C总线接口(I2C引脚功能，并已使能I2C主模式)
****************************************************************************/
#include "config.h"
#include "type_def.h"

#define I2C_FAIL_RETRY_TIME    2
#define    I2C_WAIT_LOOP    800



/****************************************************************************
* 名称：Init_I2C()
* 功能：主模式I2C初始化。
* 入口参数：fi2c        初始化I2C总线速率，最大值为400K
* 出口参数：无
****************************************************************************/
void Init_I2C(uint32 fi2c)
{
    //PINSEL0 |= 0x50;                    // 设置I2C控制口有效(原来应为输入口)
                                          //在INIT_PORT()函数中已经配置 
    I2SCLH = (Fpclk/fi2c + 1) / 2;        // 设置I2C时钟为fi2c
    I2SCLL = (Fpclk/fi2c) / 2;
    I2CONSET = 0x40;                    // 使能I2C
}

/****************************************************************************
* 名称：I2C_Wait_Stat()
* 功能：等待状态
* 入口参数：无
* 出口参数：无
****************************************************************************/
void I2C_Wait_Stat(void) 
{
sint32 di=I2C_WAIT_LOOP;
    while(--di)
    {
        if(I2CONSET & 0x8) break;    //SI置高则退出
    }
}

/****************************************************************************
* 名称：I2C_Start()
* 功能：发起始条件
* 入口参数：无
* 出口参数：无
****************************************************************************/
void I2C_Start(void)
{
    I2CONCLR = 0x0C;            //清SI和AA
    I2CONSET = 0x20;            //发起始条件
    I2C_Wait_Stat();
}

/****************************************************************************
* 名称：I2C_Tx_Data()
* 功能：发一个字节
* 入口参数：发送数据
* 出口参数：无
****************************************************************************/
void I2C_Tx_Data(uint8 data)
{
    I2DAT = data;                //发送数据
    I2CONCLR = 0x28;            //清STA和SI
    I2C_Wait_Stat();
}

/****************************************************************************
* 名称：I2C_Rv_Data()
* 功能：接收一个字节
* 入口参数：无
* 出口参数：接收数据
****************************************************************************/
uint8 I2C_Rv_Data(void)
{
    I2CONCLR = 0x28;            //清STA和SI
    I2C_Wait_Stat();
    return(I2DAT);                //返回数据
}

/****************************************************************************
* 名称：I2C_Stop()
* 功能：发停止条件
* 入口参数：无
* 出口参数：无
****************************************************************************/
void I2C_Stop(void)
{
    I2CONSET = 0x10;    //发停止条件
    I2CONCLR = 0x0C;    //清SI和AA
}

/****************************************************************************
* 名称：I2C_Send_Byte()
* 功能：向无子地址器件发送一字节数据。
* 入口参数：sla        器件地址
*          dat        要发送的数据
* 出口参数：操作正确返回0, 否则返回1
****************************************************************************/
uint8 I2C_Send_Byte(uint8 sla, uint8 dat)
{
uint32 retrytime=0;
    while(1)
    {
        I2C_Start();            //发起始条件
        I2C_Tx_Data(sla);        //发器件地址
        if(I2STAT==0x18) break;    //状态正确则继续
        I2C_Stop();                //否则发停止条件
        if(++retrytime>I2C_FAIL_RETRY_TIME) return(1);//重试超数则出错退出
    }
    I2C_Tx_Data(dat);            //发数据
    I2C_Stop();                    //停止
    return(0);
}

/****************************************************************************
* 名称：I2C_Send_Str()
* 功能：向有子地址器件发送多字节数据。
* 入口参数：sla        器件从机地址
*          suba        器件子地址
*          s        数据发送缓冲区指针
*          no        发送数据个数
* 出口参数：操作正确返回0, 否则返回1
****************************************************************************/
uint8 I2C_Send_Str(uint8 sla, uint8 suba, uint8 *s, uint8 no)
{
uint32 retrytime=0;
    while(1)
    {
        I2C_Start();            //发起始条件
        I2C_Tx_Data(sla);        //发器件地址
        if(I2STAT==0x18) break;    //状态正确则继续
        I2C_Stop();                //否则发停止条件
        if(++retrytime>I2C_FAIL_RETRY_TIME) return(1);//重试超数则出错退出
    }
    I2C_Tx_Data(suba);
    while(no)
    {
        I2C_Tx_Data(*s);        //发数据
        s++;
        no--;
    }
    I2C_Stop();                    //停止
    return(0);
}

/****************************************************************************
* 名称：I2C_Rcv_Byte()
* 功能：向无子地址器件读取一字节数据。
* 入口参数：sla        器件地址
*          dat        接收数据的变量指针
* 出口参数：操作正确返回0, 否则返回1
****************************************************************************/
uint8 I2C_Rcv_Byte(uint8 sla, uint8 *dat)
{
uint32 retrytime=0;
    while(1)
    {
        I2C_Start();            //发起始条件
        I2C_Tx_Data(sla+1);        //发器件地址(读)
        if(I2STAT==0x40) break;    //状态正确则继续
        I2C_Stop();                //否则发停止条件
        if(++retrytime>I2C_FAIL_RETRY_TIME) return(1);//重试超数则出错退出
    }    
    *dat = I2C_Rv_Data();        //接收数据
    I2C_Stop();                    //停止
    return(0);
}

/****************************************************************************
* 名称：I2C_Rcv_Str()
* 功能：向有子地址器件读取多字节数据。
* 入口参数：sla        器件地址
*          suba        器件子地址
*          s        数据接收缓冲区指针
*              no         读取数据个数
* 出口参数：操作正确返回0, 否则返回1
****************************************************************************/
uint8 I2C_Rcv_Str(uint8 sla, uint8 suba, uint8 *s, uint8 no)
{
uint32 retrytime=0;
    while(1)
    {
        I2C_Start();            //发起始条件
        I2C_Tx_Data(sla);        //发器件地址
        if(I2STAT==0x18) break;    //状态正确则继续
        I2C_Stop();                //否则发停止条件
        if(++retrytime>I2C_FAIL_RETRY_TIME) return(1);//重试超数则出错退出
    }
    I2C_Tx_Data(suba);    
    I2CONSET = 0x24;            //发起始条件和置AA(重复起始)
    I2CONCLR = 0x08;            //清SI
    I2C_Wait_Stat();            //等待
    I2C_Tx_Data(sla+1);            //发地址(读)
    while(no)
    {
        if(no==1) I2CONCLR = 0x04;    //接收最后一个数据(AA清0)
        *s = I2C_Rv_Data();        //接收数据
        s++;
        no--;
    }
    I2C_Stop();                    //停止
    return(0);
}
