//**********************************************************************
//文件  名:key_scan.c
//说    明:每次读完一个键码后都要清对应的键值
//函数列表:
//1.键盘扫描:Scan_Key
//2.读按键状态(按下/松开):Get_Key_Status
//3.读键码:Get_Key_Code
//**********************************************************************
#include "key_scan.h"
#include "port.h"
#include "type_def.h"
#include "lpc2400.h"

static volatile uint16 key_status,key_press;
//**********************************************************************
//函数  名:Scan_Key
//函数功能:分时段扫描键盘,并记录扫描结果(放在中断中2ms扫描一次)
//入口参数:无
//出口参数:无
//说    明:每2ms扫描2个键,扫描周期为14ms
//**********************************************************************
void Scan_Key(void)
{

}

//**********************************************************************
//函数  名:Get_Key_Status
//函数功能:读键状态
//入口参数:无
//出口参数:键状态值(对应位1表示此键被按下)
//**********************************************************************
uint16 Get_Key_Status(void)
{
    return(key_status);
}

